
#define COUNT_ED_IZM    69
#define LEN_ED_IZM      8

const char *const msgMasEdIzm[]= {
    "   ",  	// 0
    "м¬",		// 1 
    "¬",    	// 2 
    "к¬",   	// 3 
    "мј",   	// 4 
    "ј",    	// 5 
    "кј",   	// 6 
    "√ц",   	// 7 
    "к√ц",  	// 8 
    "к¬јр",   	// 9  »«ћ≈Ќ≈Ќќ! с ¬ј
    "к¬ј",  	// 10
    "¬т",   	// 11
    "к¬т",  	// 12
    "мќм",  	// 13
    "ќм",   	// 14
    "кќм",  	// 15
    "ћќм",  	// 16 
    "мк√н", 	// 17
    "м√н",  	// 18
    "мкс",  	// 19
    "мс",   	// 20
    "сек",  	// 21
    "мин",  	// 22
    "ч ",   	// 23
    "мм",   	// 24
    "см",   	// 25
    "дм",   	// 26
    "м ",   	// 27
    "об/м", 	// 28
    "∞—",   	// 29
    "%%",    	// 30
    "м2",   	// 31
    "м3",   	// 32
    "м2/м", 	// 33
    "м3/ч", 	// 34
    "опис", 	// 35
    "атм",  	// 36
    "л",    	// 37
    "g",    	// 38
    "√ц/с", 	// 39
    "¬/с",  	// 40
    "%%/с",  	// 41
    "км",		// 42
    "м/с2",     // 43
    "кѕа",      // 44
    "ћѕа",      // 45
    "кг/см2",   // 46
    "psi",      // 47
    "∞F",       // 48
    "куб/с",    // 49
    "к¬т/ч", 	// 50
    "ћ¬т/ч",    // 51
    "¬/км",     // 52
    "ћвар/ч",   // 53
    "рад",      // 54
    "рад/с",    // 55
    "рад/с2",   // 56
    "кг/м2",    // 57
    "¬б",       // 58
    "Ќм",  		// 59
    "град",     // 60
    "√н",       // 61
    "1/с",      // 62
    "кг",       // 63
    "мм2",      // 64
    "кг/м3",    // 65
    "бар",      // 66
    "¬б",       // 67
    "бит"       // 68
};

char MasEdIzmTek[COUNT_ED_IZM][LEN_ED_IZM];