/************************** (C) Copyright 2013 Triol ***************************
* File Name          : TimeMy.h
* Author             : Kats Eyvhen
* TS Idea            : 2013.04.25
* TS Version         : 2013.04.25
* Description        : Function for work with time
*******************************************************************************/

/* Define to prevent recursive inclusion ------------------------------------ */
#ifndef TIME_MY_H
#define TIME_MY_H



/* Includes ------------------------------------------------------------------*/



/* Exported define -----------------------------------------------------------*/
// Возвращает количество прошедших секунд со старта системы
#define GetSecCount() ((u16)(OSTimeGet() / 1000))


/* Exported macro ------------------------------------------------------------*/



/* Exported types ------------------------------------------------------------*/



/* Exported constants --------------------------------------------------------*/



/* Exported variables --------------------------------------------------------*/



/* Exported function prototypes ----------------------------------------------*/
// Возвращает количество прошедших Tick'ов от прошлого значения
u32 GetTickLeft(u32 TickPrev);
// Возвращает количество прошедших секунд от прошлого значения
u16 GetSecLeft(u16 SecPrev);
// Возвращает количество прошедших Tick'ов от прошлого значения в U16
u16 GetTickLeftU16(u16 TickPrev);


/* Exported functions --------------------------------------------------------*/



#endif // TIME_MY_H

/************************** (C) Copyright 2013 Triol **************************/