
#include "globalIncludes.h"

//===================================================================
// Функция вызывается в обработчике прерывания от системного таймера
// и предназначена для запуска периодических задач
//===================================================================
void App_TimeTickHook(void)
{
    static  u16     tmr100ms;

    if(tmr100ms != 0){
        tmr100ms--;
    }
    else{
        tmr100ms = SysTime100ms;
        OSSemPost( SemMenu );
    }
}
//===================================================================
