/************************** (C) Copyright 2013 Triol ***************************
* File Name          : VersionPo.h
* Author             : Kats Eyvhen
* TS Idea            : 2013.04.19
* TS Version         : 2013.04.19
* Description        : Function show CRC and version PO
*******************************************************************************/

/* Define to prevent recursive inclusion ------------------------------------ */
#ifndef VERSION_PO_H
#define VERSION_PO_H

/* Includes ------------------------------------------------------------------*/



/* Exported define -----------------------------------------------------------*/
#define GRP_VERSION_PO_PU24E        36
#define SUB_VERSION_PO_PU24E        10
#define MRK_VERSION_PO_PU24E        03 // Сигнатура задана равной 4, для выполнения обратной совместимости с загрузчиком 36.101
// После полного ухода от 36.101 можно будет ставить корректную сигнатуру. Данный глюк описан в ПО загрузчика 36.102


/* Exported macro ------------------------------------------------------------*/



/* Exported types ------------------------------------------------------------*/



/* Exported constants --------------------------------------------------------*/



/* Exported variables --------------------------------------------------------*/



/* Exported function prototypes ----------------------------------------------*/



/* Exported functions --------------------------------------------------------*/
// **************************************************************************
//  Подсчитывает и выводит на экран CRC прошивки, 
// а также версию ПО
// **************************************************************************
void Version(void);


#endif // VERSION_PO

/************************** (C) Copyright 2013 Triol **************************/