#ifndef Pult_NVRAM_h
#define Pult_NVRAM_h
 
 
 typedef struct {
/* 0x0000*/    s32   UST1;  //Контраст
/* 0x0004*/    s32   UST2;  //Скор. обмена
/* 0x0008*/    s32   UST3;  //T вспл. сообщ.
/* 0x000C*/    s32   UST4;  //Температ.
/* 0x0010*/    s32   UST5;  //Уст. приводов
/* 0x0014*/    s32   UST6;  //Местн./дист.
/* 0x0018*/    s32   UST7;  //Адр. для местн.
/* 0x001C*/    s32   UST8;  //Адр. для добав.
/* 0x0020*/    s32   UST9;  //Добав. прив.
/* 0x0024*/    s32   UST10;  //Уставки пульта
/* 0x0028*/    s32   UST11;  //Адр. прив. чт.
/* 0x002C*/    s32   UST12;  //Читать уставки
/* 0x0030*/    s32   UST13;  //Уставки привода
/* 0x0034*/    s32   UST14;  //Уставки пульта
/* 0x0038*/    s32   UST15;  //Адр. прив. зап.
/* 0x003C*/    s32   UST16;  //Зап. уставки
/* 0x0040*/    s32   UST17;  //Пароль польз.
/* 0x0044*/    s32   UST18;  //Эталон польз.
/* 0x0048*/    s32   UST19;  //Пароль техн.
/* 0x004C*/    s32   UST20;  //Эталон техн.
/* 0x0050*/    s32   UST21;  //Пароль маст.
/* 0x0054*/    s32   UST22;  //Эталон маст.
/* 0x0058*/    s32   UST23;  //Версия ПО
/* 0x005C*/    s32   UST23_Sec;
//-------------------- 
 } AllNV_Type;
// 96
#endif //Pult_NVRAM_h
